In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data =np.random.rand(4,3)

In [5]:
data

array([[0.33169348, 0.35723336, 0.6698236 ],
       [0.15481937, 0.7703449 , 0.27569883],
       [0.8135369 , 0.42148484, 0.26106222],
       [0.61044681, 0.98422507, 0.20142762]])

In [6]:
 dataFrame = pd.DataFrame(data)

In [7]:
dataFrame

          0         1         2
0  0.331693  0.357233  0.669824
1  0.154819  0.770345  0.275699
2  0.813537  0.421485  0.261062
3  0.610447  0.984225  0.201428

In [8]:
yeniDataFrame = pd.DataFrame(data,index=["Baran","Öner","Arda","Çolak"],columns = ["Maas","Yas","Calısma Saati"])

In [9]:
yeniDataFrame

           Maas       Yas  Calısma Saati
Baran  0.331693  0.357233       0.669824
Öner   0.154819  0.770345       0.275699
Arda   0.813537  0.421485       0.261062
Çolak  0.610447  0.984225       0.201428

In [10]:
yeniDataFrame["Maas"]

Baran    0.331693
Öner     0.154819
Arda     0.813537
Çolak    0.610447
Name: Maas, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

           Maas       Yas
Baran  0.331693  0.357233
Öner   0.154819  0.770345
Arda   0.813537  0.421485
Çolak  0.610447  0.984225

In [12]:
yeniDataFrame.loc["Baran"]

Maas             0.331693
Yas              0.357233
Calısma Saati    0.669824
Name: Baran, dtype: float64

In [14]:
yeniDataFrame.iloc[1]

Maas             0.154819
Yas              0.770345
Calısma Saati    0.275699
Name: Öner, dtype: float64

In [15]:
yeniDataFrame["Emeklilik Yasi"]= yeniDataFrame["Yas"] + yeniDataFrame['Yas']

In [16]:
yeniDataFrame

           Maas       Yas  Calısma Saati  Emeklilik Yasi
Baran  0.331693  0.357233       0.669824        0.714467
Öner   0.154819  0.770345       0.275699        1.540690
Arda   0.813537  0.421485       0.261062        0.842970
Çolak  0.610447  0.984225       0.201428        1.968450

In [17]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

           Maas       Yas  Calısma Saati
Baran  0.331693  0.357233       0.669824
Öner   0.154819  0.770345       0.275699
Arda   0.813537  0.421485       0.261062
Çolak  0.610447  0.984225       0.201428

In [18]:
yeniDataFrame.drop("Öner",axis=0)

           Maas       Yas  Calısma Saati  Emeklilik Yasi
Baran  0.331693  0.357233       0.669824        0.714467
Arda   0.813537  0.421485       0.261062        0.842970
Çolak  0.610447  0.984225       0.201428        1.968450

In [20]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [21]:
yeniDataFrame

           Maas       Yas  Calısma Saati
Baran  0.331693  0.357233       0.669824
Öner   0.154819  0.770345       0.275699
Arda   0.813537  0.421485       0.261062
Çolak  0.610447  0.984225       0.201428

In [22]:
yeniDataFrame.loc["Baran","Yas"]

0.3572333578707453

In [24]:
boolean =yeniDataFrame<0

In [25]:
yeniDataFrame[boolean]

       Maas  Yas  Calısma Saati
Baran   NaN  NaN            NaN
Öner    NaN  NaN            NaN
Arda    NaN  NaN            NaN
Çolak   NaN  NaN            NaN

In [26]:
yeniDataFrame[yeniDataFrame<0]

       Maas  Yas  Calısma Saati
Baran   NaN  NaN            NaN
Öner    NaN  NaN            NaN
Arda    NaN  NaN            NaN
Çolak   NaN  NaN            NaN

In [27]:
yeniDataFrame["Yas"]>0

Baran    True
Öner     True
Arda     True
Çolak    True
Name: Yas, dtype: bool

In [35]:
yeniDataFrame[yeniDataFrame["Yas"] > 0.4]

           Maas       Yas  Calısma Saati
Öner   0.154819  0.770345       0.275699
Arda   0.813537  0.421485       0.261062
Çolak  0.610447  0.984225       0.201428